{
    "metadata": {
        "total_size": 799885504,
        "total_parameters": 752392448
    },
    "weight_map": {
        "language_model.model.embed_tokens.biases": "model.safetensors",
        "language_model.model.embed_tokens.scales": "model.safetensors",
        "language_model.model.embed_tokens.weight": "model.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.0.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.0.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.0.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.0.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.0.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.0.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.0.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.0.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.0.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.0.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.0.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.0.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.1.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.1.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.1.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.1.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.1.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.1.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.1.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.1.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.1.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.1.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.1.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.1.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.10.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.10.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.10.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.10.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.10.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.10.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.10.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.10.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.10.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.10.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.10.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.10.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.10.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.11.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.11.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.11.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.11.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.11.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.11.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.11.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.11.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.11.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.k_norm.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.biases": "model.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.scales": "model.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.biases": "model.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.scales": "model.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.q_norm.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.biases": "model.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.scales": "model.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.biases": "model.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.scales": "model.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.12.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.12.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.12.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.12.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.12.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.12.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.12.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.12.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.12.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.12.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.12.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.12.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.12.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.12.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.13.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.13.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.13.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.13.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.13.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.13.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.13.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.13.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.13.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.13.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.13.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.13.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.13.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.14.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.14.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.14.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.14.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.14.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.14.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.14.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.14.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.14.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.14.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.14.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.14.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.14.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.15.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.15.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.15.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.15.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.15.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.15.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.15.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.15.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.15.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.k_norm.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.biases": "model.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.scales": "model.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.biases": "model.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.scales": "model.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.q_norm.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.biases": "model.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.scales": "model.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.biases": "model.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.scales": "model.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.16.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.16.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.16.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.16.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.16.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.16.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.16.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.16.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.16.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.16.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.16.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.16.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.16.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.16.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.17.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.17.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.17.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.17.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.17.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.17.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.17.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.17.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.17.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.17.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.17.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.17.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.17.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.17.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.18.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.18.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.18.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.18.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.18.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.18.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.18.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.18.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.18.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.18.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.18.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.18.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.18.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.18.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.19.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.19.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.19.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.19.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.19.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.19.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.19.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.19.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.19.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.19.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.19.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.k_norm.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.k_proj.biases": "model.safetensors",
        "language_model.model.layers.19.self_attn.k_proj.scales": "model.safetensors",
        "language_model.model.layers.19.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.o_proj.biases": "model.safetensors",
        "language_model.model.layers.19.self_attn.o_proj.scales": "model.safetensors",
        "language_model.model.layers.19.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.q_norm.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.q_proj.biases": "model.safetensors",
        "language_model.model.layers.19.self_attn.q_proj.scales": "model.safetensors",
        "language_model.model.layers.19.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.19.self_attn.v_proj.biases": "model.safetensors",
        "language_model.model.layers.19.self_attn.v_proj.scales": "model.safetensors",
        "language_model.model.layers.19.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.2.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.2.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.2.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.2.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.2.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.2.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.2.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.2.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.2.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.2.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.2.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.2.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.2.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.2.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.2.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.2.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.20.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.20.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.20.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.20.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.20.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.20.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.20.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.20.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.20.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.20.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.20.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.20.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.20.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.20.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.20.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.20.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.21.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.21.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.21.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.21.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.21.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.21.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.21.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.21.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.21.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.21.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.21.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.21.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.21.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.21.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.21.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.21.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.22.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.22.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.22.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.22.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.22.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.22.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.22.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.22.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.22.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.22.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.22.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.22.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.22.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.22.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.22.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.22.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.23.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.23.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.23.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.23.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.23.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.23.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.23.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.23.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.23.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.23.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.23.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.k_norm.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.k_proj.biases": "model.safetensors",
        "language_model.model.layers.23.self_attn.k_proj.scales": "model.safetensors",
        "language_model.model.layers.23.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.o_proj.biases": "model.safetensors",
        "language_model.model.layers.23.self_attn.o_proj.scales": "model.safetensors",
        "language_model.model.layers.23.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.q_norm.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.q_proj.biases": "model.safetensors",
        "language_model.model.layers.23.self_attn.q_proj.scales": "model.safetensors",
        "language_model.model.layers.23.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.23.self_attn.v_proj.biases": "model.safetensors",
        "language_model.model.layers.23.self_attn.v_proj.scales": "model.safetensors",
        "language_model.model.layers.23.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.3.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.3.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.3.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.3.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.3.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.3.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.3.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.3.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.3.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.3.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.k_norm.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.k_proj.biases": "model.safetensors",
        "language_model.model.layers.3.self_attn.k_proj.scales": "model.safetensors",
        "language_model.model.layers.3.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.o_proj.biases": "model.safetensors",
        "language_model.model.layers.3.self_attn.o_proj.scales": "model.safetensors",
        "language_model.model.layers.3.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.q_norm.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.q_proj.biases": "model.safetensors",
        "language_model.model.layers.3.self_attn.q_proj.scales": "model.safetensors",
        "language_model.model.layers.3.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.v_proj.biases": "model.safetensors",
        "language_model.model.layers.3.self_attn.v_proj.scales": "model.safetensors",
        "language_model.model.layers.3.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.4.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.4.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.4.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.4.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.4.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.4.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.4.mlp.down_proj.biases": "model.safetensors",
        "language_model.model.layers.4.mlp.down_proj.scales": "model.safetensors",
        "language_model.model.layers.4.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.4.mlp.gate_proj.biases": "model.safetensors",
        "language_model.model.layers.4.mlp.gate_proj.scales": "model.safetensors",
        "language_model.model.layers.4.mlp.gate_proj.weight": "model.safetensors",
        "language_model.model.layers.4.mlp.up_proj.biases": "model.safetensors",
        "language_model.model.layers.4.mlp.up_proj.scales": "model.safetensors",
        "language_model.model.layers.4.mlp.up_proj.weight": "model.safetensors",
        "language_model.model.layers.4.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.A_log": "model.safetensors",
        "language_model.model.layers.5.linear_attn.conv1d.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.dt_bias": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_a.biases": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_a.scales": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_a.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_b.biases": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_b.scales": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_b.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_qkv.biases": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_qkv.scales": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_qkv.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_z.biases": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_z.scales": "model.safetensors",
        "language_model.model.layers.5.linear_attn.in_proj_z.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.norm.weight": "model.safetensors",
        "language_model.model.layers.5.linear_attn.out_proj.biases": "model.safetensors",
        "language_model.model.layers.5.linear_attn.out_proj.scales": "model.safetensors",
        "language_model.model.layers.5.linear_attn.out_proj.weight": "model.safetensors",
        "language_model.model.layers.5.mlp.down_proj.biases": "model.safetensors",
